Repository: RahafKeewan2/RDP
Catalog: ManageAttendance.aspx.*.resx
Languages: ar

# CheckValidator
source: You must fill all required fields before saving.
ar: يجب تعبئة الخانات المطلوب قبل عملية الحفظ

# AbsencePrivilegesFailed
source: You do not have the required permission to register violations.
ar: لا توجد لك صلاحية لإدخال المخالفات.

# AbsenceLevelRelatedWithViolationsYouCantModifyIt
source: You cannot update the absence level; since there are violations associated with it.
ar: لا يمكنك تعديل مستوى الغياب بسبب وجود مخالفات مرتبطة فيه

# EnterViolation
source: You cannot send a message to this student unless you enter a violation.
ar: لا يمكنك ارسال رسالة لهذا الطالب ما لم تقم بإدخال مخالفه له.

# MarksEntryPeriodClosed
source: You cannot register violations; since marks' entry period is closed.
ar: لا تستطيع ادخال مخالفات لان فترة ادخال العلامات مغلقة

# HoursInstalledForTheDay
source: You cannot enter behavior and attendance; since the attendance has been confirmed for this day.
ar: لا يمكن إدخال الانضباط المدرسي و الالتزام بالدوام المدرسي، لأنه تم تثبيت الدوام لهذا اليوم.

# gvTeacherClassesResource1.NoRowsWarningMessage
source: You are not associated with this section yet.
ar: لم يتم ريطك بهذا الشعبة بعد

# rblWithOutExcuse
source: Without Excuse
ar: دون عذر

# ListItemResource3.Text
source: Without Excuse
ar: دون عذر

# HolidayError
source: Violations cannot be added during weekends.
ar: لا يمكن إضافة مخالفات في ايام العطل

# lbtnAbsencesResource1.Text
source: Violations
ar: مخالفات

# ViolationTypeResource.HeaderText
source: Violation Type
ar: نوع الانضباط

# lblViolationTypeResource1.Text
source: Violation Type
ar: نوع المخالفة

source: Violation Type
ar: نوع الغياب

# rblAbsence
source: Violation
ar: مخالفة

# AbsenceTipViolation
source: To register a violation, click the checkbox next to the student's name then select the violation's type.
ar: لتسجيل مخالفة ضع علامة على يمين إسم الطالب، ثم اختر نوع المخالفة

# AbsenceTipPositive
source: To register a positive quality, click the checkbox next to the student's name then select the positive quality's type.
ar: لتسجيل ايجابية ضع علامة على يمين إسم الطالب، ثم اختر نوع الايجابية

# lblToAddNewExamcommitteeResource1.Text
source: To print an empty violations sheet,
ar: لطباعة كشف مخالفات فارغ،

# lblGuideMessageFilteringResource1.Text
source: To enter behavior and attendance, specify the search criteria then click [Search].
ar: لإدخال الانضباط المدرسي والالتزام بالدوام المدرسي، اختر معايير البحث ومن ثم أنقر (ابحث)

source: To
ar: إلى

# lblCourseNameResource1.Text
source: There is no course.
ar: لا يوجد مبحث.

# gvViolationsResourcesKeys.NoDataSourceMessage
source: There is no connection with the database. Please try again later!
ar: لم يتمكن النظام من الاتصال مع قاعدة البيانات، الرجاء إعادة المحاولة لاحقاً.

# gvTeacherClassesResource1.NoDataSourceMessage
source: There is no connection with the database. Please try again later!
ar: لم يتمكن النظام من الاتصال مع قاعدة البيانات، الرجاء إعادة المحاولة لاحقاً.

# gvStudentLectureVaiolationsResource1.NoDataSourceMessage
source: There is no connection with the database. Please try again later!
ar: لم يتمكن النظام من الاتصال مع قاعدة البيانات، الرجاء إعادة المحاولة لاحقا.

# gvClassStudentsAttendanceResource1.NoDataSourceMessage
source: There is no connection with the database. Please try again later!
ar: لم يتمكن النظام من الاتصال مع قاعدة البيانات، الرجاء إعادة المحاولة لاحقاً.

# OneDayViolationsExistInTheSameDay
source: There is a full day violation in the same day.
ar: يوجد مخالفة يوم كامل في نفس اليوم

# LectureViolationExistInTheSameDay
source: There is a class violation in the same day.
ar: يوجد مخالفة حصة في نفس اليوم

# NoViolation
source: There are no violations in this day.
ar: لا يوجد مخالفات في هذا اليوم

# gvStudentLectureVaiolationsResource1.NoRowsWarningMessage
source: There are no students who match the search criteria.
ar: لا يوجد طلبة وفقاً لمعايير البحث.

# NoStudentRelatedToThisSections
source: There are no students associated with this section.
ar: لا يوجد طلبة مرتبطين بهذا الشعبة

# NoActiveSemesterExist
source: There are no students associated with this section.
ar: لا يوجد فصل فعال في التقويم المدرسي لهذه المرحلة

# gvClassStudentsAttendanceResource1.NoRowsWarningMessage
source: There are no students associated with this section.
ar: لا يوجد طلبة مرتبطين بهذا الشعبة

# lblNoDataFoundResource1.Text
source: There are no students associated with this section.
ar: لا يوجد طلبة مرتبطين بهذا الشعبة

# NoPositives
source: There are no positive qualities in this day.
ar: لا يوجد ايجابيات في هذا اليوم

# gvViolationsResourcesKeys.NoRowsWarningMessage
source: There are no classes in this day.
ar: لا يوجد حصص في هذا اليوم

# UpdateSuccessfully
source: The violation has been updated successfully.
ar: تمت عملية تعديل المخالفة بنجاح.

# AddSuccessfully
source: The saving process has been done successfully.
ar: تمت عملية الحفظ بنجاح.

# SaveSuccessfully
source: The saving process has been done successfully.
ar: تمت عملية الحفظ بنجاح.

# SaveSuccess
source: The saving process has been done successfully.
ar: تمت عملية الحفظ بنجاح

# ValidationDateMessage
source: The date must be within the semester's start and end dates.
ar: يجب ان يكون التاريخ ضمن تاريخ بداية ونهاية الفصل

# lblStudySytemResource1.Text
source: Study System
ar: النظام الدراسي

# lblStudySystemTitle.Text
source: Study System
ar: النظام الدراسي

# lblStudentsResource1.Text
source: Students
ar: الطلبة

# TemplateFieldResource3.HeaderText
source: Student Name
ar: اسم الطالب

# StudentNameResource.HeaderText
source: Student Name
ar: اسم الطالب

# BoundFieldResource1.HeaderText
source: Student Name
ar: اسم الطالب

# BoundFieldResourceName.HeaderText
source: Student Name
ar: اسم الطالب

# BehaviourLevel
source: Student Behavior Log
ar: سجل الإنضباط المدرسي للطالب

# MudabaLevel
source: Student Attendance Log on Level of
ar: سجل الالتزام بالدوام المدرسي للطالب مستوى

# lblAttendanceHistoryTitleResource1.Text
source: Student Attendance and Behavior Entry Log
ar: سجل إدخال الانضباط المدرسي و الالتزام بالدوام المدرسي للطالب

# BoundFieldResource3.HeaderText
source: Stream
ar: المرحلة / القسم / المسار

# SendSMS.Text
source: Send Message
ar: إرسال رسالة

# ChooseViolation
source: Select
ar: أختر

# BoundFieldResource4.HeaderText
source: Section
ar: الشعبة

# ConfirmMessageTitle
source: Saving Students Delay and Absence
ar: حفظ التأخير والغياب للطلبة

# PositiveType
source: Positive Quality Type
ar: تعزيزات السلوك الايجابي

# rfvAttendanceDayResource1.ErrorMessage
source: Please specify the violations' dates.
ar: اختر تاريخ المخالفات

# rfvDateResource1.ErrorMessage
source: Please specify the date.
ar: اختر التاريخ.

# ChooseViolationType
source: Please select the violation's type.
ar: اختر نوع الانضباط

# rfvViolationTypeResource1.ErrorMessage
source: Please select the violation's type.
ar: اختر نوع المخالفة.

# rfvDegreeDeductAmountResource1.ErrorMessage
source: Please select the violation's type.
ar: اختر نوع المخالفة.

# rfvddlVaiolationTypeResource1.ErrorMessage
source: Please select the violation.
ar: اختر المخالفة.

# rfvStudySystem.ErrorMessage
source: Please select the study system.
ar: اختر النظام الدراسي.

# rfvStudySystemResource1.ErrorMessage
source: Please select the study system.
ar: اختر النظام الدراسي.

# ChoosePositivityType
source: Please select the positive quality's type.
ar: اختر نوع تعزيزات السلوك الايجابي

# rvDeductTypeResource1.ErrorMessage
source: Please select the evaluation.
ar: اختر نوع التقييم.

# rfvMudabaCoursesResource1.ErrorMessage
source: Please select the deduction's type.
ar: اختر نوع الرصد.

# rfvLessonResource1.ErrorMessage
source: Please select the class.
ar: اختر الحصة.

# rfvLectureResource1.ErrorMessage
source: Please select the class.
ar: اختر الحصة.

# AddAtendanceWarning
source: Please select at least one student to register a violation.
ar: اختر طالب واحد على الأقل، لإضافة مخالفة

# lblNavigationGuideResource1.Text
source: Please make sure you save the entered data before moving to another page.
ar: الرجاء حفظ البيانات المدخلة قبل الأنتقال إلى أية صفحة أخرى.

# rfvLateMinuteResource1.ToolTip
source: Please enter the minutes.
ar: أدخل الدقائق

# rfvtbLateHourResource1.ToolTip
source: Please enter the hours.
ar: أدخل الساعات

# revtbLateMinuteResource1.ToolTip
source: Please enter an integer.
ar: أدخل عدد صحيح

# Options.HEaderText
source: Options
ar: الخيارات

# lblNoteTitleResource1.Text
source: Note
ar: ملاحظة

# cvtbLateMinuteResource1.ToolTip
source: Minutes must be integer less than (60) minutes.
ar: يجب ان تكون الدقائق رقم صحيح واقل من 60دقيقة

# cvLateMinutes
source: Minutes must be integer less than (60) minutes.
ar: يجب ان تكون الدقائق رقم صحيح واقل من 60دقيقة

# lblMinuteResource1.Text
source: Minute(s)
ar: بالدقيقة

# LateMinutes
source: min
ar: د

# MuadabaTitle
source: Log
ar: سجل

# LateHour
source: hrs
ar: س

# cvtbLateHourResource1.ToolTip
source: Hours must be integer less than (5) hours.
ar: يجب ان تكون الساعات رقم صحيح واقل من 5 ساعات

# cvLateHour
source: Hours must be integer less than (5) hours.
ar: يجب ان تكون الساعات رقم صحيح واقل من 5 ساعات

# lblHourResource1.Text
source: Hour(s)
ar: بالساعة

# BoundFieldResource2.HeaderText
source: Grade
ar: الصف

# EnableFlag
source: Full day violation has been registered or violations have been copied.
ar: تم ادخال مخالفة يوم كامل او تم نسخ المخالفات

# IsDerived
source: Full day violation has been entered.
ar: تم ادخال مخالفة يوم كامل

# TemplateFieldResource5.HeaderText
source: Excuse/ Without Excuse
ar: عذر/ دون عذر

# ListItemResource4.Text
source: Excuse
ar: عذر

# rblWithExcuse
source: Excuse
ar: عذر

# lblDeductTypeResource1.Text
source: Evaluation Type
ar: نوع الانضباط

# rblLate
source: Delay:
ar: : تأخير

# LateDuration
source: Delay Duration
ar: مدة التأخير

# LateDurationResource2.Text
source: Delay Duration
ar: مدة التأخير

# ListItemResource2.Text
source: Delay
ar: تأخير

# lblTitleModubaCoursesResource1.Text
source: Deduction Type
ar: نوع رصد

# lblDateResource1.Text
source: Date
ar: التاريخ

source: Date
ar: التاريخ

# lblSelectDayResource1.Text
source: Date
ar: التاريخ

# lblCourseResource1.Text
source: Course
ar: المبحث

# IsConfirmed
source: Class violation has been entered.
ar: تم ادخال مخالفة حصة

# lblLessonResource1.Text
source: Class
ar: الحصة

# BoundFieldResourceLecture.HeaderText
source: Class
ar: الحصة

# lblLectureResource1.Text
source: Class
ar: الحصة

# PageTitle
source: Behavior and Attendance Registration
ar: إدخال الانضباط المدرسي والالتزام بالدوام المدرسي

# PageResource1.Title
source: Behavior and Attendance Registration
ar: إدخال الانضباط المدرسي والالتزام بالدوام المدرسي

# TitleMuadaba
source: Attendance Log
ar: سجل الالتزام بالدوام المدرسي

# lblSelectedSectionResource1.Text
source: Attendance and Absence Log
ar: سجل الحضور والغياب

# ConfirmMessageBody
source: Are you sure you want to save student's absence and delay before printing?
ar: هل أنت متأكد من حفظ التأخير والغياب للطلبة قبل الطباعة؟

# AddFailed
source: An error occurred while adding the violation. Please try again later!
ar: حدث خلل أثناء إضافة المخالفة، الرجاء إعادة المحاولة لاحقاً.

# SaveFaild
source: An error occurred during the saving process. Please try again later!
ar: حدث خطأ اثناء عملية الحفظ

# SaveError
source: An error occurred during the saving process. Please try again later!
ar: حدث خلل أثناء تنفيذ عملية الحفظ.

# TemplateFieldResource4.HeaderText
source: Absence/ Delay
ar: غياب/ تأخير

# lblTitleViolation.Text
source: Absence Type
ar: نوع الغياب

# CanNotAddAbsent
source: Absence cannot be added in an inactive semester.
ar: لا يمكن إضافة غياب في فصل غير فعال

# ConnotAddAbsenceInSectionNotActive
source: Absence cannot be added in an inactive semester.
ar: لا يمكن أضافة غياب في شعبة غير فعال.

# ListItemResource1.Text
source: Absence
ar: غياب

# CantSendMessage
source: A message has been sent before.
ar: لقد تم ارسال رسالة من قبل.

# lblNoViolationConfirmation.Text
source: To confirm that there are no violations for today {0},
ar: لتأكيد عدم وجود غياب لليوم الموافق {0}،

# ConfirmationMsg
source: Are you sure you want to confirm that there are no violations for today {0}?
ar: هل أنت متأكد من تأكيد عدم وجود غياب لليوم الموافق {0} ،وأتحمل كامل المسؤولية في حال أن البيانات المدخلة غير صحيحة؟

# ConfirmationTitle
source: No violation confirmation
ar: تأكيد عدم وجود غياب

source: Confirmation Failed.
ar: حدث خطأ أثناء تأكيد الغياب، الرجاء المحاولة لاحقاً.

source: Confirmation Succeed.
ar: تمت عملية تأكيد عدم وجود غياب بنجاح.

# NoViolationsConfirmed
source: No violations for today already confirmed
ar: تم تأكيد عدم وجود غياب لهذا اليوم من قبل

# ClassDesc.HeaderText
source: Class Description
ar: الصف

# SectionDesc.HeaderText
source: Section Description
ar: الشعبة

# SpecialtyDesc.HeaderText
source: Specialty Description
ar: المرحلة / القسم / المسار

# ConfirmedViolationsExist
source: Confirmed violations exists
ar: تم إدخال غياب الطلبة لهذا اليوم

# EditDisabled
source: Cannot edit absence for this day
ar: لا يمكن تعديل الغياب لهذا اليوم

# CannotConfirm
source: Cannot confirm for this day
ar: لا يمكن تأكيد عدم وجود غياب لهذا اليوم

# Instruction
source: <p align="center" class="InstructionsBold"> إرشادات هامة</p> <p class="InstructionsBold"> تساعدك الإرشادات التالية في عملية إدخال الانضباط المدرسي والالتزام بالدوام المدرسي للطلاب : </p> <p class="StandardFontPlain" style="text-align: justify;"> <ul> <li>في حال عدم وجود غياب للطلاب تستطيع التأكيد على متابعة المدرسة للحضور والغياب في اليوم الحالي بنقر الرابط (لتأكيد عدم وجود غياب لليوم الموافق {0}). </li> <li>عندما يتم إضافة غياب للطلاب يتم تثبيته تلقائياً للتأكيد على متابعة المدرسة للحضور والغياب. </li> <li>تستطيع إضافة أو تعديل مخالفات الانضباط المدرسي والالتزام بالدوام المدرسي للطلاب في اليوم الحالي فقط أو يوم الخميس، حيث تتمكن من إضافتها أو تعديلها لكافة أيام الأسبوع. </li> </ul> </p> <br />
ar: <p align="center" class="InstructionsBold"> إرشادات هامة</p> <p class="InstructionsBold"> تساعدك الإرشادات التالية في عملية إدخال الانضباط المدرسي والالتزام بالدوام المدرسي للطلبة : </p> <p class="StandardFontPlain" style="text-align: justify;"> <ul> <li>في حال عدم وجود غياب للطلبة تستطيع التأكيد على متابعة المدرسة للحضور والغياب في اليوم الحالي بنقر الرابط (لتأكيد عدم وجود غياب لليوم الموافق {0}). </li> <li>عندما يتم إضافة غياب للطلبة يتم تثبيته تلقائياً للتأكيد على متابعة المدرسة للحضور والغياب. </li> <li>تستطيع إضافة أو تعديل مخالفات الانضباط المدرسي والالتزام بالدوام المدرسي للطلبة في اليوم الحالي فقط أو يوم الخميس، حيث تتمكن من إضافتها أو تعديلها لكافة أيام الأسبوع. </li> </ul> </p> <br />

# CannotSaveAttendance
source: Cannot save attendance for this date
ar: لا يمكن إدخال أو تعديل الغياب لهذا اليوم

source: Date Out Of Active Semester
ar: التاريخ ليس ضمن بداية ونهاية الفصل

# lblquestionnaire.TEXT
source: لتعبئة استبيان النقل المدرسي ,
ar: لتعبئة الاستبيان ,

# DegreeMuadabaCourseDesc.HeaderText
source: نوع العلامة
ar: نوع المستوى

# CannotEdit
source: لا يمكن تعديل على بيانات الغياب بعد ارسالها لمدير مديرية التعليم للاعتماد
ar: لا يمكن تعديل على البيانات بعد ارسالها لمدير مديرية التعليم للاعتماد

# CannotEditt
source: لا يمكن تعديل على بيانات الغياب بعد اعتمادها من قبل مدير مديرية التعليم
ar: لا يمكن تعديل على البيانات بعد اعتمادها من قبل مدير مديرية التعليم
